#+Title:	Analysis of Old Man Winter at Nationals 2017
#+Author:	Mark Abney
#+Email:	mark.a.abney@gmail.com
#+Date:		2018-02-04

#+Startup: latexpreview
#+Property: header-args :session *R:nats_2017* :results output

#+Options: toc:nil num:nil H:5
#+Exclude_tags: no_export

#+begin_export html
---
layout: single
title: "Analysis of Old Man Winter at Nationals 2017"
permalink: /analysis2017/
author_profile: false
header:
  overlay_image: /images/nats2017_crop.jpg
  overlay_filter: 0.5
---
#+end_export

* Turnover predictors  :no_export:
  What variables tend to be correlated with a possession ending in a turnover? Variables
  that we have data on are: Received_pull, Start_location, No_of_throws. Where the thrower
  was when the possession ended we only have when the possession ended in a goal. When
  the possession ended in a turnover, and it was our possession, we have the type of
  throw, but without knowing what the type of throw was when we scored we can't figure
  out if this variable is relevant for determining our risk of a turnover.
#+begin_src R :results silent :exports none
  ## Top teams
  top.poss <- subset(top.data, Who=='Them', select=c('Received_pull', 'Start_location', 'No_of_throws', 'Last_throw'))
  top.poss <- subset(top.poss, !is.na(No_of_throws))
  Y.top <- top.poss[, 'Last_throw']
  Y.top <- ifelse(Y.top == 'turn', 1, 0)
  ## Recode opponent starting position as a numeric variable with higher numbers meaning
  ## further from the endzone.
  top.start.pos.f <- factor(top.poss[,2], levels=c('TG', 'TR', 'TM', 'OM', 'OR', 'OG'), ordered=TRUE)
  top.start.pos <- as.numeric(top.start.pos.f) - 2 # Makes effect relative to position TR

  top.num.thr <- top.poss[, 3]
  top.rec.pull <- as.numeric(top.poss[, 1])

  top.lm <- lm(Y.top ~ top.rec.pull + top.num.thr + top.start.pos)
  top.glm <- glm(Y.top ~ top.rec.pull + top.num.thr + top.start.pos, family=binomial)


  ## Consider first mid-level team possessions
  mid.poss <- subset(mid.data, Who=='Them', select=c('Received_pull', 'Start_location', 'No_of_throws', 'Last_throw'))
  mid.poss <- subset(mid.poss, !is.na(No_of_throws))
  Y.mid <- mid.poss[, 'Last_throw']
  Y.mid <- ifelse(Y.mid == 'turn', 1, 0)
  ## Recode opponent starting position as a numeric variable with higher numbers meaning
  ## further from the endzone.
  Start.pos.f <- factor(mid.poss[,2], levels=c('TG', 'TR', 'TM', 'OM', 'OR', 'OG'), ordered=TRUE)
  Start.pos <- as.numeric(Start.pos.f) - 2 # Makes effect relative to position TR

  num.thr <- mid.poss[, 3]
  rec.pull <- as.numeric(mid.poss[, 1])

  mid.lm <- lm(Y.mid ~ rec.pull + num.thr + Start.pos)
  mid.glm <- glm(Y.mid ~ rec.pull + num.thr + Start.pos, family=binomial)
  plot(jitter(Start.pos), num.thr, col=ifelse(Y == 1, 'red', 'black'))

  ## OMW possessions vs mid
  omw.v.mid <- subset(mid.data, Who == 'Us', select=c('Received_pull', 'Start_location', 'No_of_throws', 'Last_throw'))
  omw.v.mid <- subset(omw.v.mid, !is.na(No_of_throws))
  Y.omw.mid <- omw.v.mid[, 'Last_throw']
  Y.omw.mid <- ifelse(Y.omw.mid == 'turn', 1, 0)

  omw.mid.thr <- omw.v.mid[, 3]
  omw.mid.recp <- as.numeric(omw.v.mid[, 1])
  omw.mid.start.f <- factor(omw.v.mid[, 2], levels=c('OG', 'OR', 'OM', 'TM', 'TR', 'TG'))
  omw.mid.start <- as.numeric(omw.mid.start.f) - 2

  omw.mid.glm <- glm(Y.omw.mid ~ omw.mid.recp + omw.mid.thr + omw.mid.start, family=binomial)

  ## OMW possessions vs top
  omw.v.top <- subset(top.data, Who == 'Us', select=c('Received_pull', 'Start_location', 'No_of_throws', 'Last_throw'))
  omw.v.top <- subset(omw.v.top, !is.na(No_of_throws))
  Y.omw.top <- omw.v.top[, 'Last_throw']
  Y.omw.top <- ifelse(Y.omw.top == 'turn', 1, 0)

  omw.top.thr <- omw.v.top[, 3]
  omw.top.recp <- as.numeric(omw.v.top[, 1])
  omw.top.start.f <- factor(omw.v.top[, 2], levels=c('OG', 'OR', 'OM', 'TM', 'TR', 'TG'))
  omw.top.start <- as.numeric(omw.top.start.f) - 2

  omw.top.glm <- glm(Y.omw.top ~ omw.top.recp + omw.top.thr + omw.top.start, family=binomial)
#+end_src

#+begin_src R :results output :exports none
  summary(top.glm)
  summary(omw.top.glm)
  summary(mid.glm)
  summary(omw.mid.glm)
#+end_src

#+results:
#+begin_example

Call:
glm(formula = Y.top ~ top.rec.pull + top.num.thr + top.start.pos, 
    family = binomial)

Deviance Residuals: 
    Min       1Q   Median       3Q      Max  
-1.2719  -0.8331  -0.4393   1.0689   2.4880  

Coefficients:
              Estimate Std. Error z value Pr(>|z|)  
(Intercept)    0.51665    0.85798   0.602    0.547  
top.rec.pull  -0.03455    0.84323  -0.041    0.967  
top.num.thr   -0.29711    0.13518  -2.198    0.028 *
top.start.pos  0.04124    0.26880   0.153    0.878  
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 49.572  on 40  degrees of freedom
Residual deviance: 41.781  on 37  degrees of freedom
AIC: 49.781

Number of Fisher Scoring iterations: 5

Call:
glm(formula = Y.omw.top ~ omw.top.recp + omw.top.thr + omw.top.start, 
    family = binomial)

Deviance Residuals: 
    Min       1Q   Median       3Q      Max  
-2.1502   0.1689   0.3579   0.7249   1.7798  

Coefficients:
              Estimate Std. Error z value Pr(>|z|)  
(Intercept)     2.1171     1.3687   1.547    0.122  
omw.top.recp    0.6492     0.9984   0.650    0.516  
omw.top.thr    -0.5088     0.2131  -2.387    0.017 *
omw.top.start   0.4962     0.4323   1.148    0.251  
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 41.054  on 36  degrees of freedom
Residual deviance: 30.083  on 33  degrees of freedom
AIC: 38.083

Number of Fisher Scoring iterations: 5

Call:
glm(formula = Y.mid ~ rec.pull + num.thr + Start.pos, family = binomial)

Deviance Residuals: 
    Min       1Q   Median       3Q      Max  
-2.0993  -0.9595   0.5248   0.9220   1.8161  

Coefficients:
            Estimate Std. Error z value Pr(>|z|)    
(Intercept) -0.46849    0.54259  -0.863 0.387900    
rec.pull    -0.71653    0.44342  -1.616 0.106111    
num.thr     -0.17334    0.05935  -2.920 0.003495 ** 
Start.pos    0.72539    0.19343   3.750 0.000177 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 153.44  on 112  degrees of freedom
Residual deviance: 129.66  on 109  degrees of freedom
AIC: 137.66

Number of Fisher Scoring iterations: 3

Call:
glm(formula = Y.omw.mid ~ omw.mid.recp + omw.mid.thr + omw.mid.start, 
    family = binomial)

Deviance Residuals: 
    Min       1Q   Median       3Q      Max  
-1.9018  -1.0588   0.5984   0.9381   1.7808  

Coefficients:
              Estimate Std. Error z value Pr(>|z|)   
(Intercept)   -0.26840    0.52886  -0.508  0.61179   
omw.mid.recp   0.73749    0.51125   1.443  0.14916   
omw.mid.thr   -0.17560    0.05354  -3.280  0.00104 **
omw.mid.start  0.50957    0.18430   2.765  0.00569 **
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

(Dispersion parameter for binomial family taken to be 1)

    Null deviance: 153.44  on 112  degrees of freedom
Residual deviance: 132.59  on 109  degrees of freedom
AIC: 140.59

Number of Fisher Scoring iterations: 4
#+end_example

